import 'package:chechen_tradition/features/places/models/culture_place.dart';

final List<CulturalPlace> mockPlaces = [
  CulturalPlace(
      name: 'Мечеть «Сердце Чечни»',
      description:
          'Мечеть «Сердце Чечни» — одна из самых больших мечетей мира. Открыта 17 октября 2008 года и названа именем Ахмат-Хаджи Кадырова, муфтия непризнанной Чеченской Республики Ичкерия и первого президента Чеченской Республики. \n \n Мечеть располагается в центральной части города Грозного, на пересечении проспектов Хусейна Исаева и имени В. В. Путина. Неподалёку течёт река Сунжа (приток Терека). Мечеть возведена среди живописного парка, рядом расположены университет им. Кунта-Хаджи и Духовное управление мусульман ЧР. \n \n Мечеть построена в классическом османском стиле. Центральный зал накрыт огромным куполом (диаметр — 16 м, высота — 32 м). Высота четырёх минаретов — по 63 метра. Площадь мечети составляет 5000 квадратных метров, а вместимость — более 10 тысяч человек.  \n \n Во внутреннем убранстве мечети присутствует декор из белого мрамора и традиционные узоры чеченской культуры. Тексты из Корана нанесены с помощью золотого напыления высшей пробы. Внутри находятся 36 люстр, изготовленных из золота и бронзы высочайшего качества, специально разработанных для мечети. \n \n Мечеть открыта круглосуточно, но путешественникам лучше не посещать её во время намаза, чтобы не помешать верующим. Молитвы проходят пять раз в день, визит стоит запланировать в перерывах между службами. \n \n Адрес: Грозный, проспект Хусейна Исаева, 90',
      location: const GeoPoint(latitude: 43.31780, longitude: 45.69400),
      type: PlaceType.architecture,
      imageUrl:
          'https://avatars.mds.yandex.net/get-entity_search/7564214/1131801531/S600xU_2x',
      images: [
        'https://cdn.culture.ru/images/331e4952-063d-5efe-b756-e4e723c4ef47',
        'https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_6603d170fda68537e51126c9_6603d25fe2c17d0661c999e9/scale_1200',
        'https://avatars.mds.yandex.net/i?id=d0f12a389a4ffc531cfdfd6641e45eea_l-10448002-images-thumbs&n=13',
      ]),
  CulturalPlace(
    name: 'Национальный музей',
    description:
        'Национальный музей Чеченской Республики — чеченский краеведческо-исторический музей, расположенный в Грозном. \n \n Основан в 1924 году как краеведческий музей. Изначально располагался в небольшом помещении и включал частную коллекцию Бориса Скалиотти, состоящую из оружия, старинной посуды и археологических находок. Сегодня музей объединил коллекции двух основных музеев — Чеченского Республиканского музея изобразительных искусств имени Петра Захарова и Чеченского государственного объединённого музея. В его фондах хранится более 250 тысяч экспонатов, представляющих культурное и историческое наследие Чечни. Среди них — археологические и нумизматические собрания, коллекции графики, живописи и скульптуры, а также традиционная чеченская посуда и оружие. \n \n Адрес: Грозный Проспект Путина, 3б',
    location: const GeoPoint(latitude: 43.3243, longitude: 45.682351),
    type: PlaceType.museum,
    imageUrl:
        'https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Музей_Чеченской_Республики.jpg/1600px-Музей_Чеченской_Республики.jpg',
    images: [
      'https://avatars.mds.yandex.net/i?id=a86cd701919298e0b73498e9c7bf759aaef02892-9867831-images-thumbs&n=13',
      'https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Музей_Чеченской_Республики.jpg/1600px-Музей_Чеченской_Республики.jpg',
      'https://pic.rutubelist.ru/video/8f/86/8f86a77201dcfbad141d0f7dfcb3001a.jpg',
    ],
  ),
  CulturalPlace(
    name: 'Английский Замок',
    description:
        '«Английский замок» в Грозном — здание в готическом и мавританском стиле, построенное в 20-х годах XX века. Название получило из-за национальности заказчиков и внешней схожести с английской архитектурой времён Тюдоров. \n \n История: в здании располагался нефтяной отраслевой институт ГрозНИИ, первый подобный институт в СССР и один из первых отраслевых нефтяных институтов в мире. На цокольном этаже находилась лаборатория Грознефти, на базе которой потом был создан ГрозНИИ. Остальные этажи были офисными. \n \n Особенности: трёхэтажное здание с зубчатыми фасадными стенами, высокими окнами и арочными проёмами в коридорах, с величественным главным входом и роскошной лестницей. Единственной данью традиционной чеченской архитектуре была башня, стилизованная под минарет. В годы военных кампаний 90-х годов прошлого века здание было частично разрушено и находилось в аварийном состоянии. \n \n В мае 2024 года «Английский замок» был открыт для посещений. Здание воссоздали максимально идентично оригиналу, сохранив при этом следы разрушений. \n \n Адрес: ул. Братьев Дубининых, 23, Грозный.',
    location: const GeoPoint(latitude: 43.306395, longitude: 45.678155),
    type: PlaceType.museum,
    imageUrl:
        'https://avatars.mds.yandex.net/i?id=317c113647481dacd6722934ac4ba54089c8eb4e-9858395-images-thumbs&n=13',
    images: [
      'https://avatars.mds.yandex.net/i?id=3c95347434374ff8db7322df7bf57a64_l-2431798-images-thumbs&n=13',
      'https://avatars.mds.yandex.net/get-altay/11302718/2a000001902546ecdbc7dfcf1bee64536338/L',
      'https://avatars.mds.yandex.net/get-altay/14578051/2a00000193d4fad5a5112e4c44b82f52770f/L',
    ],
  ),
  CulturalPlace(
    name: 'Шира Бена-Юрт',
    description:
        'Шира Бена-Юрт — древний город, расположенный в 10 км от Грозного. Город был построен в 10-11 веке и является одним из самых древних городов Чечни. В городе находится множество интересных достопримечательностей, таких как крепость, мечеть и дворец. \n \n Адрес: Ножай-Юртовский район, с. Беной',
    location: const GeoPoint(latitude: 42.966616, longitude: 46.352646),
    type: PlaceType.museum,
    imageUrl:
        'https://avatars.mds.yandex.net/i?id=297e783920f3cb75900ebbf2459146c2d1158e63-10932937-images-thumbs&n=13',
    images: [
      'https://avatars.mds.yandex.net/i?id=dc90006715db088bddd5404e8498db5967e1bbb1-8977890-images-thumbs&n=13',
      'https://avatars.mds.yandex.net/i?id=f40b3090e0cb6642bc462b8e1492616fd12e51ea-5088393-images-thumbs&n=13',
    ],
  ),
  CulturalPlace(
    name: 'Краеведческий музей имени Хусейна Исаева',
    imageUrl:
        'https://avatars.mds.yandex.net/i?id=fdd2cd887cd2b4b1836d42d2ac69ce79dcdcedae-7055114-images-thumbs&n=13',
    images: [
      'https://avatars.mds.yandex.net/get-altay/5596516/2a0000017ece7be023f3055ca4a8de674dc1/XXXL',
      'https://avatars.mds.yandex.net/get-altay/1970665/2a00000188d19bbb9942241e95a5a284e6bd/XXXL',
      'https://avatars.mds.yandex.net/get-altay/13206609/2a0000018f0bf6bbd131349cd2d937eb3e24/XXXL',
      'https://avatars.mds.yandex.net/get-altay/9686455/2a0000018b290ee74c6f28026321cd2bb28c/XXXL',
    ],
    description:
        'Краеведческий музей имени Хусейна Исаева расположен в селе Итум-Кали Итум-Калинского района Чечни, открыт в сентябре 2011 года.  \n \n Музей находится на территории замкового комплекса Пхакоч, который расположен у входа в ущелье Тазбичи. Комплекс воссоздан на базе средневекового историко-архитектурного комплекса XI–XV веков Пхьакоч.  \n \n Внутри крепости расположены несколько жилых башен, боевая башня, водяная мельница, каменные строения. Многие камни башенного комплекса покрыты петроглифами.  \n \n На первом этаже одной из жилых башен размещается краеведческий музей. В состав экспозиции входят старинное оружие, утварь, предметы быта, орудия труда.  \n \n На втором этаже располагается мемориальный музей Хусейна Исаева — первого председателя госсовета республики, погибшего в 2004 году во время теракта на стадионе «Динамо» в Грозном. Экспозиция воспроизводит обстановку рабочего кабинета политика. Здесь хранятся его личные вещи, документы с его пометками, научные труды Исаева. \n \n Адрес: Чеченская Республика, Итум-Калинский район, с. Итум-Кали.',
    location: const GeoPoint(latitude: 42.728417, longitude: 45.572356),
    type: PlaceType.museum,
  ),
];
